In [1]:
import pandas as pd

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [4]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [5]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [6]:
s.name='인구'
s.index.name='도시'

In [7]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [8]:
s/100 # 벡터화연산

도시
서울    99043.12
부산    34487.37
인천    28904.51
대구    24660.52
Name: 인구, dtype: float64

In [9]:
s['부산']

3448737

In [14]:
# s[1]
s.iloc[1]

3448737

In [18]:
s
s[[0,3,1]]
s.iloc[[0,3,1]]
s[['서울', '대구', '부산']]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [22]:
s
s[['부산','인천']]
s.iloc[[1,2]]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [24]:
s[1:3]
s.iloc[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [26]:
s
s['부산':'인천'] # 번호로 주면 끝 포함 x, 라벨은 끝 포함 o

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [28]:
s.부산
s.인천

2890451

In [29]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [30]:
'부산' in s

True

In [32]:
for k, v in s.items():
    print(k, v)

서울 9904312
부산 3448737
인천 2890451
대구 2466052

In [36]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
              index=['대전', '인천', '부산', '서울']) # 내가 지정한 순서대로 데이터 출력
s2 # 2015년 인구로 가정

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [34]:
# s = pd.Series([9904312, 3448737, 2890451, 2466052],
#               index=["서울", "부산", "인천", "대구"])
s # 2010년도 인구로 가정

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [39]:
s-s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [41]:
# Series 간 연산시 양쪽 모두 자료가 존재하면 계산이 수행
# 어느 한쪽만 자료가 존재하면 NaN(Not a Number)이 나오고, 전체 결과 자료형 또한 float로 변환됨
ds = s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [43]:
s.values
s2.values

array([1490158, 2632035, 3393191, 9631482], dtype=int64)

In [44]:
s.values - s2.values

array([ 8414154,   816702,  -502740, -7165430], dtype=int64)

In [45]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [46]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [47]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
s # 2010년도 인구

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [49]:
s2 # 2015년도 인구

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [61]:
# 서울, 부산, 인천 도시에 대한 인구 증가(감소)율(%)을 출력하시오
rs = (s-s2)/s2*100
rs
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [63]:
rs['부산']
rs['부산']=1.63
rs['부산']

1.63

In [65]:
del rs['서울']

In [66]:
rs

부산    1.630000
인천    9.818107
dtype: float64

In [67]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [69]:
obj.array
obj.index

RangeIndex(start=0, stop=4, step=1)

In [70]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [73]:
obj2.array
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [74]:
obj2['a']

-5

In [75]:
obj2['d'] = 6
obj2['d']

6

In [76]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [77]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [78]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [79]:
'b' in obj2

True

In [81]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [83]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [84]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [85]:
pd.Series(sdata)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [86]:
states = ["California", "Ohio", "Oregon", "Texas"]
states

['California', 'Ohio', 'Oregon', 'Texas']

In [87]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [94]:
obj4.notnull()
obj4.notna()

pd.notnull(obj4)
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [95]:
obj4.isnull()
obj4.isna()

pd.isnull(obj4)
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [96]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [97]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [98]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [99]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [100]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [101]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [102]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [104]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [109]:
pd.Series(data)

state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
dtype: object

In [110]:
frame = pd.DataFrame(data) # dict의 키가 dataframe의 열 이름, value에 해당하는 것들이 각각의 데이터로 옴
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [107]:
# data2 = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
#         "year": [2000, 2001, 2002, 2001, 2002, 2003],
#         "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# pd.DataFrame(data2)

In [112]:
frame.head()
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [113]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [114]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [116]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [117]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [118]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [120]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [121]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [124]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [125]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [126]:
# iloc : 고유의 행 인덱스 번호를 지정하여 자료를 참조
# loc :행 인덱스 라벨을 지정하여 자료를 참조
frame2
# loc : frame2를 출력했을 때 눈에 보이는 행 인덱스 라벨을 지정하여 자료 참조
# iloc : frame2를 출력했을 때 눈에 보이지 않는 고유의 인덱스 번호(0~5번...) -> 행 인덱스 라벨

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [127]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [128]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [129]:
frame2.iloc[-1]

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: 5, dtype: object

In [131]:
# frame2.loc[-1] error 발생

In [133]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [134]:
s.loc['서울']

9904312

In [137]:
# s.iloc['서울'] error 발생, 고유번호
s.iloc[0]

9904312

In [138]:
s.iloc[-1]

2466052

In [139]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [140]:
frame2['debt']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [141]:
# 데이터프레임의 특정 행/열을 추출하면 시리즈가 나오게 됨

In [143]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [154]:
frame2['dept'] = 16.5

In [155]:
frame2

   year   state  pop  debt  dept
0  2000    Ohio  1.5   0.0  16.5
1  2001    Ohio  1.7   1.0  16.5
2  2002    Ohio  3.6   2.0  16.5
3  2001  Nevada  2.4   3.0  16.5
4  2002  Nevada  2.9   4.0  16.5
5  2003  Nevada  3.2   5.0  16.5

In [159]:
del frame2['dept']

In [160]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [156]:
import numpy as np

In [161]:
frame2["debt"] = np.arange(6.)

In [162]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [163]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [164]:
type(val)

pandas.core.series.Series

In [165]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [167]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [168]:
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [169]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [174]:
frame2['eastern'] = frame2['state'] == 'Ohio'

In [175]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [176]:
del frame2['eastern']

In [177]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [178]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [183]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9, 2003: 3.1}}
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
 'Nevada': {2001: 2.4, 2002: 2.9, 2003: 3.1}}

In [184]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [185]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [186]:
frame3.T

        2000  2001  2002  2003
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   2.9   3.1

In [187]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
 'Nevada': {2001: 2.4, 2002: 2.9, 2003: 3.1}}

In [188]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [189]:
pd.DataFrame(populations, index=[2001, 2002])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [190]:
pd.DataFrame(populations, index=[2001, 2002, 2004])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2004   NaN     NaN

In [191]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [192]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
2003    NaN
Name: Ohio, dtype: float64

In [197]:
frame3['Ohio'][:2]
frame3['Ohio'].head(2)
frame3['Ohio'].iloc[[0,1]]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [199]:
frame3['Nevada'][:-2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [202]:
pd.DataFrame({
    'Ohio': frame3['Ohio'][:2],
    'Nevada': frame3['Nevada'][:-2]
})

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [203]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [205]:
frame3.index.name='year'

In [206]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [207]:
frame3.columns.name = 'state'

In [208]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     3.1

In [210]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9],
       [nan, 3.1]])

In [211]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [212]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [214]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int32

In [215]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [216]:
index=obj.index

In [217]:
index[1:]

Index(['b', 'c'], dtype='object')

In [220]:
obj2 = pd.Series([1.5, -2.5, 0], index=np.arange(1,4))
obj2

1    1.5
2   -2.5
3    0.0
dtype: float64

In [223]:
4 in obj2.index

False

In [224]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     3.1

In [226]:
2024 in frame3.index
'Utah' in frame3.columns

False

In [228]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [229]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [230]:
obj.reindex(["a", "b", "c", "d", "e"])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [231]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [232]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [233]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [236]:
obj3.reindex(np.arange(6), method='ffill') # 결측값을 대체할 때 방향을 forward(위->아래) fill
obj3.reindex(np.arange(6), method='bfill') # 결측값을 대체할 때 방향을 backward(아래->위) fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [237]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [238]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [239]:
states = ["Texas", "Utah", "California"]

In [240]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [241]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [242]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [245]:
frame.loc[['a', 'd', 'c']]

   Ohio  Texas  California
a     0      1           2
d     6      7           8
c     3      4           5

In [246]:
frame.loc[['a','d','c'],'California']
frame.loc[['a','d','c'],['California','Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [247]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [248]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [249]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [250]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [251]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [252]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [253]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [256]:
# data.drop('two') error발생, 'two'라는 행 index가 없음
# data.drop(columns='two')
# data.drop('two', axis=1)
data.drop('two', axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [257]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [258]:
data.drop('two', axis='columns', inplace=True)

In [259]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [260]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [265]:
obj[1]
obj[2:4]
obj[[1,3]] # obj.iloc[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [266]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [267]:
obj1

2    1
0    2
1    3
dtype: int64

In [268]:
obj2

a    1
b    2
c    3
dtype: int64

In [272]:
obj1.iloc[:3]
obj1.loc[[2,0,1]]

2    1
0    2
1    3
dtype: int64

In [273]:
obj2.loc['b':'c']

b    2
c    3
dtype: int64

In [274]:
obj2.loc['b':'c']=10

In [275]:
obj2

a     1
b    10
c    10
dtype: int64

In [276]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [277]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [278]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [279]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [280]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [281]:
# three열 값이 5보다 큰 자료를 추출
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [282]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [283]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [285]:
data[data<5]=0

In [286]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [287]:
# 5, 6 출력

In [302]:
data[(data == 5) | (data == 6)]
data.iloc[1][[1,2]]
data.loc['Colorado'][[1,2]]
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [303]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [311]:
data.iloc[[1, 2]]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [313]:
data.iloc[[1, 2],[3,0]]

          four  one
Colorado     7    0
Utah        11    8

In [304]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [305]:
data.iloc[2,3]

11

In [310]:
data.iloc[2,[3,0]]
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [314]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [317]:
data[:3]
data.iloc[[0,1,2]]
data.loc['Ohio':'Utah']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [318]:
data.loc['Ohio':'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [319]:
data.iloc[:]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [320]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [321]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [322]:
data.loc['Ohio']

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [323]:
data.three

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [324]:
data.three > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [325]:
data[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [330]:
# 1.
# (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
se1 = pd.Series([1,2,3,4], index=['a', 'b', 'c', 'd'])
se1

a    1
b    2
c    3
d    4
dtype: int64

In [331]:
se2 = pd.Series([3,2,4,1], index=['a', 'b', 'c', 'e'])
se2

a    3
b    2
c    4
e    1
dtype: int64

In [337]:
# (2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
se1 + se2
se1 - se2
se1 * se2
se1 / se2

a    0.333333
b    1.000000
c    0.750000
d         NaN
e         NaN
dtype: float64

In [338]:
# 2. 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.
pd.DataFrame({'fruit' : ['apple', 'banana', 'mango', 'grape', 'peach'],
             'number' : [1,2,3,4,5],
             'height' : [123.4, 187.4, 160.3, 193, 169.9],
             'animal' : ['cat', 'dog', 'lion', 'monkey', 'tiger'],
             'city' : ['서울', '대전', '부산', '광주', '인천']})

    fruit  number  height  animal city
0   apple       1   123.4     cat   서울
1  banana       2   187.4     dog   대전
2   mango       3   160.3    lion   부산
3   grape       4   193.0  monkey   광주
4   peach       5   169.9   tiger   인천

In [359]:
# 3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [358]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어', '영어']]
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df.loc['평균'] = df.mean()
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.loc['방자', '영어'] = 80
df.loc['평균'] = df.mean()
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[['춘향']]
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

In [382]:
df.loc['방자', '영어'] = 80
df

      국어    영어    수학  (방자, 영어)
춘향  80.0  90.0  90.0        80
몽룡  90.0  70.0  60.0        80
향단  70.0  60.0  80.0        80
방자  30.0  80.0  70.0        80
평균  67.5  65.0  75.0        80

In [387]:
df

      국어    영어    수학
춘향  80.0  90.0  90.0
몽룡  90.0  70.0  60.0
향단  70.0  60.0  80.0
방자  30.0  80.0  70.0
평균  67.5  65.0  75.0

In [388]:
df.loc['평균'] = df.mean()

In [389]:
df

      국어    영어    수학
춘향  80.0  90.0  90.0
몽룡  90.0  70.0  60.0
향단  70.0  60.0  80.0
방자  30.0  80.0  70.0
평균  67.5  73.0  75.0

In [391]:
df.loc[['춘향']]

      국어    영어    수학
춘향  80.0  90.0  90.0

In [393]:
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
Name: 향단, dtype: float64